[Helmet_Titan_M X2BodyPartTemplate]
DisplayName="泰坦装甲头盔"

[Helmet_Titan_F X2BodyPartTemplate]
DisplayName="泰坦装甲头盔"

[Helmet_GrandTitan_M X2BodyPartTemplate]
DisplayName="Grand 泰坦装甲头盔"

[Helmet_GrandTitan_F X2BodyPartTemplate]
DisplayName="Grand 泰坦装甲头盔"

[CX_TitanArmor_Arms_F X2BodyPartTemplate]
DisplayName="泰坦装甲手臂"
[CX_TitanArmor_Arms_M X2BodyPartTemplate]
DisplayName="泰坦装甲手臂"

[CX_TitanArmor_Arms2_F X2BodyPartTemplate]
DisplayName="泰坦装甲手臂 2"
[CX_TitanArmor_Arms2_M X2BodyPartTemplate]
DisplayName="泰坦装甲手臂 2"

[CX_TitanArmor_Arms3_F X2BodyPartTemplate]
DisplayName="泰坦装甲手臂 3"
[CX_TitanArmor_Arms3_M X2BodyPartTemplate]
DisplayName="泰坦装甲手臂 3"

[CX_GrandTitanArmor_Arms_F X2BodyPartTemplate]
DisplayName=" 重型泰坦装甲手臂"
[CX_GrandTitanArmor_Arms_M X2BodyPartTemplate]
DisplayName=" 重型泰坦装甲手臂"

[CX_GrandTitanArmor_Arms2_F X2BodyPartTemplate]
DisplayName="重型泰坦装甲手臂 2"
[CX_GrandTitanArmor_Arms2_M X2BodyPartTemplate]
DisplayName="重型泰坦装甲手臂 2"

[CX_GrandTitanArmor_Arms3_F X2BodyPartTemplate]
DisplayName="重型泰坦装甲手臂 3"
[CX_GrandTitanArmor_Arms3_M X2BodyPartTemplate]
DisplayName=" 重型泰坦装甲手臂 3"

[TitanArmor X2ArmorTemplate]
FriendlyName="泰坦装甲"
BriefSummary="泰坦装甲是一种重型攻击型装甲。这副盔甲可以保护我们的士兵免受火灾和任何形式的毒药。泰坦装甲为穿戴者提供大量HP和护甲提升。"
TacticalText="<Bullet/>泰坦装甲是一种重型攻击型装甲。这副盔甲可以保护我们的士兵免受火灾和任何形式的毒药。泰坦装甲为穿戴者提供大量HP和护甲提升。

[GrandTitanArmor X2ArmorTemplate]
FriendlyName="重型泰坦装甲"
BriefSummary="重型泰坦装甲是泰坦装甲的一个附加组件。增强了防护力，可以当成全掩体保护其他士兵。"
TacticalText="<Bullet/>重型泰坦装甲是泰坦装甲的一个附加组件。增强了防护力，可以当成全掩体保护其他士兵。

[TitanStrike X2AbilityTemplate]
LocFriendlyName="泰坦重击"
LocFlyOverText="泰坦重击"
LocHelpText="重击地面造成区域伤害。4回合冷却"
LocLongDescription="泰坦重击是一种分裂性的区域攻击技能，它会向地面发射冲击波，对区域内的所有目标造成伤害。4回合冷却。"
LocPromotionPopupText="<Bullet/>泰坦重击<br/><Bullet/> 4回合冷却。<br/><Bullet/> 使用1行动点，不结束回合。<br/>"

[GrandTitanStrike X2AbilityTemplate]
LocFriendlyName="加强泰坦重击"
LocFlyOverText="加强泰坦重击"
LocHelpText="重击地面造成区域伤害。3回合冷却"
LocLongDescription="加强泰坦重击是一种分裂性的区域攻击技能，它会向地面发射冲击波，对该区域内的所有目标造成伤害。3回合冷却。"
LocPromotionPopupText="<Bullet/>加强泰坦重击<br/><Bullet/> 3回合冷却<br/><Bullet/> 使用1行动点，不结束回合。<br/>"

[AssaultPoweredArmorTech X2TechTemplate]
DisplayName="攻击动力装甲"
Summary="基于我们对重型星装甲的理解，我们应该能够装配一种更强大的攻击动力装甲，并通过一个元素单元来给它提供动力。这种新的泰坦盔甲应该非常耐用，会带来一些新的技能，我们可以投掷敌人。"
CodeName="泰坦"
LongDescription="这些新的泰坦装甲是对我们现有装备的重大升级。再加上外星人厚重的生化服所使用的技术，我们应该能够保护我们的士兵免受他们可能遇到的大多数危险。莉莉·沈。"


[TitanArmorImmunities X2AbilityTemplate]
LocFriendlyName="泰坦装甲免疫"
LocLongDescription="对所有毒药，酸和火免疫。"
LocHelpText="对所有毒药，酸和火免疫。"